app/Models/ModelBatalyon.php

    public function allKabupaten($id_provinsi)
    {
        return $this->db->table('tbl_kabupaten')
        ->where('id_provinsi', $id_provinsi)
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_kabupaten`
WHERE `id_provinsi` = '31'

    public function allKecamatan($id_kabupaten)
    {
        return $this->db->table('tbl_kecamatan')
        ->where('id_kabupaten', $id_kabupaten)
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_kecamatan`
WHERE `id_kabupaten` = '3173'