app/Models/ModelKesatuan.php

    public function AllData()
    {
        return $this->db->table('tbl_kesatuan')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kesatuan`

    public function DetailData($id)
    {
        return $this->db->table('tbl_kesatuan')
        ->where('id',$id)
        ->get()->getRowArray();
---
SELECT *
FROM `tbl_kesatuan`
WHERE `id` = '2'