app/Models/ModelKodam.php

    public function AllData()
    {
        return $this->db->table('tbl_batalyon')
            ->join('tbl_komando', 'tbl_komando.id_komando = tbl_batalyon.id_komando', 'left')
            ->get()->getResultArray();
---
SELECT `tbl_kodam`.*, `tbl_kesatuan`.`kesatuan`, `tbl_kesatuan`.`marker`, `tbl_wilayah`.`nama_wilayah`
FROM `tbl_kodam`
LEFT JOIN `tbl_kesatuan` ON `tbl_kesatuan`.`id` = `tbl_kodam`.`id_kesatuan`
LEFT JOIN `tbl_wilayah` ON `tbl_wilayah`.`id` = `tbl_kodam`.`id_wilayah`

    public function allProvinsi()
    {
        return $this->db->table('tbl_provinsi')
            ->orderBy('id_provinsi', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_provinsi`
ORDER BY `id_provinsi` ASC