app/Models/ModelAdmin.php

SELECT COUNT(*) AS `numrows` FROM `tbl_batalyon`
---
    public function JmlBatalyon()
    {
        return $this->db->table('tbl_batalyon')
            ->countAll();