app/Models/ModelAdmin.php

SELECT COUNT(*) AS `numrows` FROM `tbl_wilayah`
---
    public function JmlWilayah()
    {
        return $this->db->table('tbl_wilayah')
            ->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_kodam`
---
    public function JmlKodam()
    {
        return $this->db->table('tbl_kodam')
            ->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_lantamal`
---
    public function JmlLantamal()
    {
        return $this->db->table('tbl_lantamal')
            ->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_koopsud`
---
    public function JmlKoopsud()
    {
        return $this->db->table('tbl_koopsud')
            ->countAll();

SELECT SUM(`jml_tank`) AS `jml_tank`, SUM(`jml_tank_2`) AS `jml_tank_2`
FROM `tbl_kodam`
---
    public function TotalTank()
    {
        return $this->db->table('tbl_kodam')
            ->selectSum('jml_tank')
            ->selectSum('jml_tank_2')
            ->get()->getRowArray();

SELECT SUM(`jml_artileri`) AS `jml_artileri`, SUM(`jml_artileri_2`) AS `jml_artileri_2`
FROM `tbl_kodam`
---
    public function TotalArtileri()
    {
        return $this->db->table('tbl_kodam')
            ->selectSum('jml_artileri')
            ->selectSum('jml_artileri_2')
            ->get()->getRowArray();

SELECT SUM(`jml_helikopter`) AS `jml_helikopter`, SUM(`jml_helikopter_2`) AS `jml_helikopter_2`
FROM `tbl_kodam`
---
    public function TotalHelikopter()
    {
        return $this->db->table('tbl_kodam')
            ->selectSum('jml_helikopter')
            ->selectSum('jml_helikopter_2')
            ->get()->getRowArray();

SELECT SUM(`jml_artileri`) AS `jml_artileri`, SUM(`jml_artileri_2`) AS `jml_artileri_2`
FROM `tbl_lantamal`
---
    public function TotalArtileriLantamal()
    {
        return $this->db->table('tbl_lantamal')
            ->selectSum('jml_artileri')
            ->selectSum('jml_artileri_2')
            ->get()->getRowArray();

SELECT SUM(`jml_armada_kapal_selam`) AS `jml_armada_kapal_selam`, SUM(`jml_armada_kapal_selam_2`) AS `jml_armada_kapal_selam_2`
FROM `tbl_lantamal`
---
    public function TotalKapalSelam()
    {
        return $this->db->table('tbl_lantamal')
            ->selectSum('jml_armada_kapal_selam')
            ->selectSum('jml_armada_kapal_selam_2')
            ->get()->getRowArray();

SELECT SUM(`jml_armada_kapal_permukaan`) AS `jml_armada_kapal_permukaan`, SUM(`jml_armada_kapal_permukaan_2`) AS `jml_armada_kapal_permukaan_2`
FROM `tbl_lantamal`
---
    public function TotalKapalPermukaan()
    {
        return $this->db->table('tbl_lantamal')
            ->selectSum('jml_armada_kapal_permukaan')
            ->selectSum('jml_armada_kapal_permukaan_2')
            ->get()->getRowArray();

SELECT SUM(`jml_amunisi`) AS `jml_amunisi`, SUM(`jml_amunisi_2`) AS `jml_amunisi_2`
FROM `tbl_koopsud`
---
    public function TotalAmunisi()
    {
        return $this->db->table('tbl_koopsud')
            ->selectSum('jml_amunisi')
            ->selectSum('jml_amunisi_2')
            ->get()->getRowArray();

SELECT SUM(`jml_pertahanan_udara`) AS `jml_pertahanan_udara`, SUM(`jml_pertahanan_udara_2`) AS `jml_pertahanan_udara_2`
FROM `tbl_koopsud`
---
    public function TotalPertahananUdara()
    {
        return $this->db->table('tbl_koopsud')
            ->selectSum('jml_pertahanan_udara')
            ->selectSum('jml_pertahanan_udara_2')
            ->get()->getRowArray();

SELECT SUM(`jml_pesawat_terbang`) AS `jml_pesawat_terbang`, SUM(`jml_pesawat_terbang_2`) AS `jml_pesawat_terbang_2`
FROM `tbl_koopsud`
---
    public function TotalPesawatTerbang()
    {
        return $this->db->table('tbl_koopsud')
            ->selectSum('jml_pesawat_terbang')
            ->selectSum('jml_pesawat_terbang_2')
            ->get()->getRowArray();