app/Models/ModelKoopsud.php

    public function AllData()
    {
        return $this->db->table('tbl_koopsud')
            //->join('tbl_kesatuan', 'tbl_kesatuan.id = tbl_koopsud.id_kesatuan', 'left')
            ->select('tbl_koopsud.*, tbl_kesatuan.kesatuan, tbl_kesatuan.marker, tbl_wilayah.nama_wilayah') // <-- ambil nama kesatuan!
            ->join('tbl_kesatuan', 'tbl_kesatuan.id = tbl_koopsud.id_kesatuan', 'left') // join yang benar
            ->join('tbl_wilayah', 'tbl_wilayah.id = tbl_koopsud.id_wilayah', 'left')
            ->get()
            ->getResultArray();
---
SELECT `tbl_koopsud`.*, `tbl_kesatuan`.`kesatuan`, `tbl_kesatuan`.`marker`, `tbl_wilayah`.`nama_wilayah`
FROM `tbl_koopsud`
LEFT JOIN `tbl_kesatuan` ON `tbl_kesatuan`.`id` = `tbl_koopsud`.`id_kesatuan`
LEFT JOIN `tbl_wilayah` ON `tbl_wilayah`.`id` = `tbl_koopsud`.`id_wilayah`