app/Models/ModelAuth.php

    public function Login($email)
    {
        return $this->db->table('tbl_user')
            ->where('email', $email)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `email` = 'admin@gmail.com'