app/Models/ModelWilayah.php

SELECT *
FROM `tbl_wilayah`
---
    public function AllData()
    {
        return $this->db->table('tbl_wilayah')
            ->get()->getResultArray();

SELECT *
FROM `tbl_wilayah`
WHERE `id_wilayah` = '5'
---
    public function DetailData($id_wilayah)
    {
        return $this->db->table('tbl_wilayah')
            ->where('id_wilayah', $id_wilayah)
            ->get()->getRowArray();

DELETE FROM `tbl_wilayah`
WHERE `id_wilayah` = '11'
AND `id_wilayah` = '11'
---
    public function DeleteData($data)
    {
        $this->db->table('tbl_wilayah')
        ->where('id_wilayah', $data['id_wilayah'])
        ->delete($data);