app/Models/ModelKomando.php

SELECT *
FROM `tbl_komando`
---
    public function AllData()
    {
        return $this->db->table('tbl_komando')
            ->get()->getResultArray();