app/Models/ModelKodam.php

    public function DetailData($id)
    {
        return $this->db->table('tbl_kodam')
            ->join('tbl_kesatuan', 'tbl_kesatuan.id = tbl_kodam.id_kesatuan', 'left')
            ->join('tbl_wilayah', 'tbl_wilayah.id = tbl_kodam.id_wilayah', 'left')
            ->where('tbl_kodam.id', $id)
            ->select('tbl_kodam.*, tbl_kesatuan.kesatuan, tbl_wilayah.id as wilayah_id, tbl_wilayah.nama_wilayah') // Perhatikan alias untuk id wilayah
            ->get()->getRowArray();
---
SELECT `tbl_kodam`.*, `tbl_kesatuan`.`kesatuan`, `tbl_wilayah`.`id` as `wilayah_id`, `tbl_wilayah`.`nama_wilayah`
FROM `tbl_kodam`
LEFT JOIN `tbl_kesatuan` ON `tbl_kesatuan`.`id` = `tbl_kodam`.`id_kesatuan`
LEFT JOIN `tbl_wilayah` ON `tbl_wilayah`.`id` = `tbl_kodam`.`id_wilayah`
WHERE `tbl_kodam`.`id` = '11'