app/Models/ModelBatalyon.php

SELECT *
FROM `tbl_batalyon`
LEFT JOIN `tbl_kesatuan` ON `tbl_kesatuan`.`id` = `tbl_batalyon`.`id_komando`
---
    public function AllData()
    {
        return $this->db->table('tbl_batalyon')
            ->join('tbl_komando', 'tbl_komando.id_komando = tbl_batalyon.id_komando', 'left')
            ->get()->getResultArray();

SELECT *
FROM `tbl_batalyon`
LEFT JOIN `tbl_komando` ON `tbl_komando`.`id_komando` = `tbl_batalyon`.`id_komando`
WHERE `id_wilayah` = '5'
---
    public function AllDataPerWilayah($id_wilayah)
    {
        return $this->db->table('tbl_batalyon')
            ->join('tbl_komando', 'tbl_komando.id_komando = tbl_batalyon.id_komando', 'left')
            ->where('id_wilayah', $id_wilayah)
            ->get()->getResultArray();

SELECT *
FROM `tbl_batalyon`
LEFT JOIN `tbl_komando` ON `tbl_komando`.`id_komando` = `tbl_batalyon`.`id_komando`
WHERE `tbl_batalyon`.`id_komando` = '1'
---
    public function AllDataPerKomando($id_komando)
    {
        return $this->db->table('tbl_batalyon')
            ->join('tbl_komando', 'tbl_komando.id_komando = tbl_batalyon.id_komando', 'left')
            ->where('tbl_batalyon.id_komando', $id_komando)
            ->get()->getResultArray();