app/Models/ModelLantamal.php

SELECT `tbl_lantamal`.*, `tbl_kesatuan`.`kesatuan`, `tbl_kesatuan`.`marker`, `tbl_wilayah`.`nama_wilayah`
FROM `tbl_lantamal`
LEFT JOIN `tbl_kesatuan` ON `tbl_kesatuan`.`id` = `tbl_lantamal`.`id_kesatuan`
LEFT JOIN `tbl_wilayah` ON `tbl_wilayah`.`id` = `tbl_lantamal`.`id_wilayah`
---
    public function AllData()
    {
        return $this->db->table('tbl_lantamal')
            ->select('tbl_lantamal.*, tbl_kesatuan.kesatuan, tbl_kesatuan.marker, tbl_wilayah.nama_wilayah') // <-- ambil nama kesatuan!
            ->join('tbl_kesatuan', 'tbl_kesatuan.id = tbl_lantamal.id_kesatuan', 'left') // join yang benar
            ->join('tbl_wilayah', 'tbl_wilayah.id = tbl_lantamal.id_wilayah', 'left')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_lantamal`
LEFT JOIN `tbl_kesatuan` ON `tbl_kesatuan`.`id` = `tbl_lantamal`.`id_kesatuan`
WHERE `tbl_lantamal`.`id_kesatuan` = '2'
---
    public function AllDataPerKesatuan($id)
    {
        return $this->db->table('tbl_lantamal')
            ->join('tbl_kesatuan', 'tbl_kesatuan.id = tbl_lantamal.id_kesatuan', 'left')
            ->where('tbl_lantamal.id_kesatuan', $id)
            ->get()->getResultArray();