app/Views/v_dashboard.php

          <?php
          $db = \Config\Database::connect();
          foreach ($komando as $key => $value) {
            $jml = $db->table('tbl_batalyon')->where('id_komando', $value['id_komando'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_batalyon`
WHERE `id_komando` = '1'